# 1. Setup Environment & Koneksi Database

**Tujuan:**
Menginisialisasi library Python dan mengatur koneksi ke database PostgreSQL MIMIC-III.

**Perbaikan Syntax & Konfigurasi:**
* Mengganti `cPickle` (Python 2) menjadi `pickle` (Python 3).
* Menyesuaikan kredensial database (`user`, `password`, `host`).
* Mengubah *path* output dari Windows (`D:\\`) ke Linux (`./data_output/`).
* Membuat folder output otomatis agar tidak error saat menyimpan file.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import psycopg2
import pprint
import pickle  # Ganti cPickle jadi pickle
import os

# Konfigurasi Koneksi Database (Sesuai Laptop Anda)
conn = psycopg2.connect(
    dbname="mimic",
    user="yusuf",
    password="bGtPoX@99!./",  # Password Anda
    host="localhost",
    port="5432"
)

# Konfigurasi Folder Output
# Kita gunakan folder relatif './data_output/' agar aman
exportdir = "./data_output/"

# Buat folder jika belum ada (agar tidak error saat save CSV nanti)
if not os.path.exists(exportdir):
    os.makedirs(exportdir)

print("Koneksi berhasil. Folder output siap di:", exportdir)

Koneksi berhasil. Folder output siap di: ./data_output/

# 2. Ekstraksi Kultur (Culture Items)

**Tujuan:**
Mengambil data pengambilan sampel kultur (darah, urin, sputum, dll) dari tabel `CHARTEVENTS`.

**Penjelasan Teknis:**
* Query ini memfilter data berdasarkan daftar `ITEMID` spesifik yang merepresentasikan prosedur pengambilan kultur.
* **Relevansi:** Waktu pengambilan kultur (`charttime`) digunakan sebagai salah satu penanda waktu (t_0) untuk menentukan *onset* kecurigaan infeksi dalam kriteria Sepsis-3.
* **Output:** Disimpan ke file `culture.csv`.

In [2]:
query = """
select subject_id, hadm_id, icustay_id, extract(epoch from charttime) as charttime, itemid
from chartevents
where itemid in (6035,3333,938,941,942,4855,6043,2929,225401,225437,225444,225451,225454,225814,225816,225817,225818,225722,225723,225724,225725,225726,225727,225728,225729,225730,225731,225732,225733,227726,70006,70011,70012,70013,70014,70016,70024,70037,70041,225734,225735,225736,225768,70055,70057,70060,70063,70075,70083,226131,80220)
order by subject_id, hadm_id, charttime
"""

print("Extracting culture...")
d = pd.read_sql_query(query,conn)
d.to_csv(exportdir+'culture.csv',index=False,sep='|')
d.head()

Extracting culture...

/tmp/ipykernel_31434/1994754651.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  d = pd.read_sql_query(query,conn)

   subject_id  hadm_id  icustay_id     charttime  itemid
0           2   163353    243653.0  5.318688e+09    3333
1           5   178980    214757.0  4.199839e+09    3333
2           7   118037    236754.0  4.777583e+09    3333
3           8   159514    262299.0  4.666858e+09    3333
4          16   103251    240232.0  6.566774e+09    3333

# 3. Ekstraksi Data Mikrobiologi

**Tujuan:**
Mengambil seluruh riwayat waktu tes mikrobiologi dari tabel `MICROBIOLOGYEVENTS` (positif maupun negatif).

**Penjelasan Teknis:**
* Query ini mengambil waktu (`charttime`) dan tanggal (`chartdate`) tes mikrobiologi.
* Data ini digunakan untuk memvalidasi apakah pasien benar-benar menjalani tes infeksi bakteri/jamur sebagai syarat kriteria Sepsis-3.
* **Output:** File `microbio.csv`.

In [3]:
query = """
select subject_id, hadm_id, extract(epoch from charttime) as charttime, extract(epoch from chartdate) as chartdate 
from microbiologyevents
"""
print("Extracting microbiology...")
d = pd.read_sql_query(query,conn)
d.to_csv(exportdir+'microbio.csv',index=False,sep='|')
d.head()

Extracting microbiology...

/tmp/ipykernel_31434/876952596.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  d = pd.read_sql_query(query,conn)

   subject_id  hadm_id     charttime     chartdate
0          96   170324  5.878535e+09  5.878483e+09
1          96   170324  5.879135e+09  5.879088e+09
2          96   170324  5.879146e+09  5.879088e+09
3          96   170324           NaN  5.879088e+09
4          96   170324           NaN  5.879088e+09

# 4. Ekstraksi Pemberian Antibiotik

**Tujuan:**
Mengambil data waktu pemberian antibiotik dari tabel `PRESCRIPTIONS` berdasarkan kode GSN (Generic Sequence Number).

**Relevansi:**
Dalam kriteria Sepsis-3, dugaan infeksi (*Suspected Infection*) ditandai dengan kombinasi pengambilan kultur dan pemberian antibiotik.

**Output:** File `abx.csv`.

In [4]:
# Kode asli dengan daftar GSN yang sangat panjang (TIDAK DIUBAH)
# Hanya menghapus 'mimiciii.' di bagian FROM

query = """
select hadm_id, icustay_id, extract(epoch from startdate) as startdate, extract(epoch from enddate) as enddate
from prescriptions
where gsn in ('002542','002543','007371','008873','008877','008879','008880','008935','008941','008942','008943','008944','008983','008984','008990','008991','008992','008995','008996','008998','009043','009046','009065','009066','009136','009137','009162','009164','009165','009171','009182','009189','009213','009214','009218','009219','009221','009226','009227','009235','009242','009263','009273','009284','009298','009299','009310','009322','009323','009326','009327','009339','009346','009351','009354','009362','009394','009395','009396','009509','009510','009511','009544','009585','009591','009592','009630','013023','013645','013723','013724','013725','014182','014500','015979','016368','016373','016408','016931','016932','016949','018636','018637','018766','019283','021187','021205','021735','021871','023372','023989','024095','024194','024668','025080','026721','027252','027465','027470','029325','029927','029928','037042','039551','039806','040819','041798','043350','043879','044143','045131','045132','046771','047797','048077','048262','048266','048292','049835','050442','050443','051932','052050','060365','066295','067471')
order by hadm_id, icustay_id
"""

print("Extracting antibiotics...")
d = pd.read_sql_query(query,conn)
d.to_csv(exportdir+'abx.csv',index=False,sep='|')
d.head()

Extracting antibiotics...

/tmp/ipykernel_31434/4283305970.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  d = pd.read_sql_query(query,conn)

   hadm_id  icustay_id     startdate       enddate
0   100006    291788.0  4.363632e+09  4.363978e+09
1   100006         NaN  4.363978e+09  4.364150e+09
2   100007         NaN  5.530810e+09  5.530810e+09
3   100009    253656.0  6.070723e+09  6.070896e+09
4   100009    253656.0  6.070896e+09  6.070982e+09

# 5. Ekstraksi Demografi & Komorbiditas (Elixhauser)

**Tujuan:**
Menggabungkan data dasar pasien (Umur, Gender, Tanggal Masuk/Keluar) dengan skor risiko penyakit penyerta (komorbiditas).

**Sumber Data:**
* `ADMISSIONS` (Data kunjungan)
* `ICUSTAYS` (Data rawat ICU)
* `PATIENTS` (Data tanggal lahir/meninggal)
* `ELIXHAUSER_QUAN` (Tabel penyakit yang baru kita generate)

**Penjelasan Teknis & Kalkulasi:**
* **Umur (Age):** Dihitung dari selisih `intime` (masuk ICU) dikurangi `dob` (tanggal lahir).
* **Mortalitas:**
    * `morta_hosp`: Meninggal di rumah sakit.
    * `morta_90`: Meninggal dalam 90 hari setelah masuk (indikator penting outcome jangka panjang).
* **Elixhauser Score:** Penjumlahan biner (0/1) dari berbagai penyakit kronis (Gagal Jantung, Hipertensi, Diabetes, dll).
* **Output:** File `demog.csv`.

In [5]:
# 1. Buat File SQL Elixhauser (Original Logic)
elixhauser_sql = """
-- ELIXHAUSER QUAN COMORBIDITY SCORE
-- Logic taken from: https://github.com/MIT-LCP/mimic-code

DROP TABLE IF EXISTS elixhauser_quan CASCADE;
CREATE TABLE elixhauser_quan AS
WITH diagnosis_list AS
(
    SELECT hadm_id, icd9_code
    FROM diagnoses_icd
),
elixhauser AS
(
    SELECT hadm_id
    , MAX(CASE WHEN icd9_code BETWEEN '39891' AND '39899' OR icd9_code BETWEEN '40201' AND '40291' OR icd9_code BETWEEN '40401' AND '40491' OR icd9_code = '428' OR icd9_code BETWEEN '4280' AND '4289' THEN 1 ELSE 0 END) AS congestive_heart_failure
    , MAX(CASE WHEN icd9_code BETWEEN '42610' AND '42613' OR icd9_code = '4262' OR icd9_code = '4263' OR icd9_code = '4264' OR icd9_code BETWEEN '42650' AND '42653' OR icd9_code BETWEEN '4266' AND '4268' OR icd9_code = '4270' OR icd9_code = '4272' OR icd9_code = '42731' OR icd9_code = '42760' OR icd9_code = '4279' OR icd9_code = '7850' OR icd9_code = 'V450' OR icd9_code = 'V533' THEN 1 ELSE 0 END) AS cardiac_arrhythmias
    , MAX(CASE WHEN icd9_code BETWEEN '09320' AND '09324' OR icd9_code BETWEEN '3940' AND '3971' OR icd9_code BETWEEN '3979' AND '3979' OR icd9_code BETWEEN '4240' AND '42491' OR icd9_code BETWEEN '7463' AND '7466' OR icd9_code = 'V422' OR icd9_code = 'V433' THEN 1 ELSE 0 END) AS valvular_disease
    , MAX(CASE WHEN icd9_code BETWEEN '4150' AND '41519' OR icd9_code BETWEEN '4160' AND '4169' OR icd9_code = '4170' OR icd9_code = '4178' OR icd9_code = '4179' THEN 1 ELSE 0 END) AS pulmonary_circulation
    , MAX(CASE WHEN icd9_code BETWEEN '4400' AND '4409' OR icd9_code BETWEEN '44100' AND '4419' OR icd9_code BETWEEN '4420' AND '4429' OR icd9_code BETWEEN '4431' AND '4439' OR icd9_code BETWEEN '4471' AND '4471' OR icd9_code = '5571' OR icd9_code = '5579' OR icd9_code = 'V434' THEN 1 ELSE 0 END) AS peripheral_vascular
    , MAX(CASE WHEN icd9_code BETWEEN '4011' AND '4019' OR icd9_code BETWEEN '40210' AND '40291' OR icd9_code BETWEEN '40410' AND '40491' OR icd9_code BETWEEN '40511' AND '40599' OR icd9_code BETWEEN '4372' AND '4372' THEN 1 ELSE 0 END) AS hypertension
    , MAX(CASE WHEN icd9_code BETWEEN '3420' AND '3449' OR icd9_code BETWEEN '43820' AND '43853' OR icd9_code = '78072' THEN 1 ELSE 0 END) AS paralysis
    , MAX(CASE WHEN icd9_code BETWEEN '3300' AND '3319' OR icd9_code = '3320' OR icd9_code = '3334' OR icd9_code = '3335' OR icd9_code = '3340' OR icd9_code BETWEEN '3350' AND '3359' OR icd9_code = '340' OR icd9_code BETWEEN '3411' AND '3419' OR icd9_code BETWEEN '34500' AND '34591' OR icd9_code BETWEEN '34700' AND '34701' OR icd9_code = '3481' OR icd9_code = '3483' OR icd9_code = '7803' OR icd9_code = '7843' THEN 1 ELSE 0 END) AS other_neurological
    , MAX(CASE WHEN icd9_code BETWEEN '490' AND '4928' OR icd9_code BETWEEN '49300' AND '49392' OR icd9_code BETWEEN '494' AND '4941' OR icd9_code BETWEEN '4950' AND '505' OR icd9_code = '5064' THEN 1 ELSE 0 END) AS chronic_pulmonary
    , MAX(CASE WHEN icd9_code BETWEEN '25000' AND '25033' OR icd9_code = '64800' OR icd9_code = '64801' OR icd9_code = '64802' OR icd9_code = '64803' OR icd9_code = '64804' OR icd9_code = '24900' OR icd9_code = '24901' OR icd9_code = '24910' OR icd9_code = '24911' OR icd9_code = '24920' OR icd9_code = '24921' OR icd9_code = '24930' OR icd9_code = '24931' THEN 1 ELSE 0 END) AS diabetes_uncomplicated
    , MAX(CASE WHEN icd9_code BETWEEN '25040' AND '25093' OR icd9_code = '7751' OR icd9_code = '24940' OR icd9_code = '24941' OR icd9_code = '24950' OR icd9_code = '24951' OR icd9_code = '24960' OR icd9_code = '24961' OR icd9_code = '24970' OR icd9_code = '24971' OR icd9_code = '24980' OR icd9_code = '24981' OR icd9_code = '24990' OR icd9_code = '24991' THEN 1 ELSE 0 END) AS diabetes_complicated
    , MAX(CASE WHEN icd9_code BETWEEN '243' AND '2442' OR icd9_code = '2448' OR icd9_code = '2449' THEN 1 ELSE 0 END) AS hypothyroidism
    , MAX(CASE WHEN icd9_code BETWEEN '40301' AND '40493' OR icd9_code BETWEEN '585' AND '5859' OR icd9_code = '586' OR icd9_code = 'V420' OR icd9_code = 'V451' OR icd9_code = 'V560' OR icd9_code = 'V561' OR icd9_code = 'V562' OR icd9_code = 'V5631' OR icd9_code = 'V5632' OR icd9_code = 'V568' THEN 1 ELSE 0 END) AS renal_failure
    , MAX(CASE WHEN icd9_code = '07022' OR icd9_code = '07023' OR icd9_code = '07032' OR icd9_code = '07033' OR icd9_code = '07044' OR icd9_code = '07054' OR icd9_code = '4560' OR icd9_code = '4561' OR icd9_code = '45620' OR icd9_code = '45621' OR icd9_code = '5710' OR icd9_code = '5712' OR icd9_code = '5713' OR icd9_code BETWEEN '57140' AND '57149' OR icd9_code = '5715' OR icd9_code = '5716' OR icd9_code = '5718' OR icd9_code = '5719' OR icd9_code = '5723' OR icd9_code = '5728' OR icd9_code = '5735' OR icd9_code = 'V427' THEN 1 ELSE 0 END) AS liver_disease
    , MAX(CASE WHEN icd9_code BETWEEN '53100' AND '53491' THEN 1 ELSE 0 END) AS peptic_ulcer
    , MAX(CASE WHEN icd9_code BETWEEN '042' AND '0449' THEN 1 ELSE 0 END) AS aids
    , MAX(CASE WHEN icd9_code BETWEEN '1400' AND '1729' OR icd9_code BETWEEN '1740' AND '1958' OR icd9_code BETWEEN '20000' AND '20892' OR icd9_code = '2386' THEN 1 ELSE 0 END) AS lymphoma
    , MAX(CASE WHEN icd9_code BETWEEN '1960' AND '1991' OR icd9_code BETWEEN '20970' AND '20975' OR icd9_code = '20979' OR icd9_code = '78951' THEN 1 ELSE 0 END) AS metastatic_cancer
    , MAX(CASE WHEN icd9_code = '7010' OR icd9_code BETWEEN '7100' AND '7109' OR icd9_code BETWEEN '7140' AND '71433' OR icd9_code BETWEEN '71481' AND '71489' OR icd9_code BETWEEN '7200' AND '7209' OR icd9_code = '725' THEN 1 ELSE 0 END) AS rheumatoid_arthritis
    , MAX(CASE WHEN icd9_code BETWEEN '2860' AND '2869' OR icd9_code = '2871' OR icd9_code BETWEEN '2873' AND '2875' THEN 1 ELSE 0 END) AS coagulopathy
    , MAX(CASE WHEN icd9_code = '2780' OR icd9_code = '27800' OR icd9_code = '27801' OR icd9_code = '27803' THEN 1 ELSE 0 END) AS obesity
    , MAX(CASE WHEN icd9_code BETWEEN '260' AND '2639' THEN 1 ELSE 0 END) AS weight_loss
    , MAX(CASE WHEN icd9_code BETWEEN '2760' AND '2769' THEN 1 ELSE 0 END) AS fluid_electrolyte
    , MAX(CASE WHEN icd9_code = '2800' OR icd9_code BETWEEN '2801' AND '2809' OR icd9_code = '2810' OR icd9_code BETWEEN '2811' AND '2819' OR icd9_code = '28521' OR icd9_code = '28522' OR icd9_code = '28529' OR icd9_code = '2859' THEN 1 ELSE 0 END) AS blood_loss_anemia
    , MAX(CASE WHEN icd9_code BETWEEN '2800' AND '28529' OR icd9_code = '2859' THEN 1 ELSE 0 END) AS deficiency_anemias
    , MAX(CASE WHEN icd9_code BETWEEN '2910' AND '2913' OR icd9_code = '2915' OR icd9_code = '2918' OR icd9_code = '29181' OR icd9_code = '29189' OR icd9_code = '2919' OR icd9_code BETWEEN '30300' AND '30393' OR icd9_code BETWEEN '30500' AND '30503' THEN 1 ELSE 0 END) AS alcohol_abuse
    , MAX(CASE WHEN icd9_code = '2920' OR icd9_code BETWEEN '29282' AND '29289' OR icd9_code = '2929' OR icd9_code BETWEEN '30400' AND '30493' OR icd9_code BETWEEN '30520' AND '30593' OR icd9_code = '64830' OR icd9_code = '64831' OR icd9_code = '64832' OR icd9_code = '64833' OR icd9_code = '64834' THEN 1 ELSE 0 END) AS drug_abuse
    , MAX(CASE WHEN icd9_code BETWEEN '29500' AND '29911' OR icd9_code = 'V113' THEN 1 ELSE 0 END) AS psychoses
    , MAX(CASE WHEN icd9_code = '3004' OR icd9_code = '30112' OR icd9_code = '3090' OR icd9_code = '3091' OR icd9_code = '311' THEN 1 ELSE 0 END) AS depression
  FROM diagnosis_list
  GROUP BY hadm_id
)
SELECT * FROM elixhauser;
"""

# 2. Simpan ke File SQL
with open('elixhauser-quan.sql', 'w') as f:
    f.write(elixhauser_sql)
    
print("File SQL berhasil dibuat. Menjalankan eksekusi tabel...")

# 3. Eksekusi Tabel ke Database
try:
    cursor = conn.cursor()
    cursor.execute(elixhauser_sql)
    conn.commit() # Python 3 Psycopg2 butuh commit untuk DDL
    print("Tabel 'elixhauser_quan' berhasil dibuat di database.")
except Exception as e:
    print("Error membuat tabel:", e)
    conn.rollback()

File SQL berhasil dibuat. Menjalankan eksekusi tabel...
Tabel 'elixhauser_quan' berhasil dibuat di database.

In [6]:
sql_file = open('elixhauser-quan.sql','r')
cursor = conn.cursor()
cursor.execute(sql_file.read())

In [8]:
query = """
select ad.subject_id, ad.hadm_id, i.icustay_id ,extract(epoch from ad.admittime) as admittime, extract(epoch from ad.dischtime) as dischtime, ROW_NUMBER() over (partition by ad.subject_id order by i.intime asc) as adm_order, case when i.first_careunit='NICU' then 5 when i.first_careunit='SICU' then 2 when i.first_careunit='CSRU' then 4 when i.first_careunit='CCU' then 6 when i.first_careunit='MICU' then 1 when i.first_careunit='TSICU' then 3 end as unit,  extract(epoch from i.intime) as intime, extract(epoch from i.outtime) as outtime, i.los,
 EXTRACT(EPOCH FROM (i.intime-p.dob)::INTERVAL)/86400 as age, extract(epoch from p.dob) as dob, extract(epoch from p.dod) as dod,
 p.expire_flag,  case when p.gender='M' then 1 when p.gender='F' then 2 end as gender,
 CAST(extract(epoch from age(p.dod,ad.dischtime))<=24*3600  as int )as morta_hosp,  --died in hosp if recorded DOD is close to hosp discharge
 CAST(extract(epoch from age(p.dod,i.intime))<=90*24*3600  as int )as morta_90,
 
 -- PERBAIKAN: Hapus 'solid_tumor' dari penjumlahan
 congestive_heart_failure+cardiac_arrhythmias+valvular_disease+pulmonary_circulation+peripheral_vascular+hypertension+paralysis+other_neurological+chronic_pulmonary+diabetes_uncomplicated+diabetes_complicated+hypothyroidism+renal_failure+liver_disease+peptic_ulcer+aids+lymphoma+metastatic_cancer+rheumatoid_arthritis+coagulopathy+obesity+weight_loss+fluid_electrolyte+blood_loss_anemia+deficiency_anemias+alcohol_abuse+drug_abuse+psychoses+depression as elixhauser

from admissions ad, icustays i, patients p, elixhauser_quan elix
where ad.hadm_id=i.hadm_id and p.subject_id=i.subject_id and elix.hadm_id=ad.hadm_id
order by subject_id asc, intime asc
"""

print("Extracting demographics...")
d = pd.read_sql_query(query,conn)
d.to_csv(exportdir+'demog.csv',index=False,sep='|')
d.head()

Extracting demographics...

/tmp/ipykernel_31434/602419852.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  d = pd.read_sql_query(query,conn)

,subject_id,hadm_id,icustay_id,admittime,dischtime,adm_order,unit,intime,outtime,los,age,dob,dod,expire_flag,gender,morta_hosp,morta_90,elixhauser
0,2,163353,243653,5.318680e+09,5.319014e+09,1,5,5.318688e+09,5.318696e+09,0.0918,0.888970,5.318611e+09,NaN,0,1,NaN,NaN,0
1,3,145834,211552,4.159278e+09,4.160210e+09,1,1,4.159279e+09,4.159803e+09,6.0646,27950.798738,1.744330e+09,4.179686e+09,1,1,0.0,0.0,2
2,4,185777,294638,6.980517e+09,6.981187e+09,1,1,6.980517e+09,6.980662e+09,1.6785,17475.020498,5.470675e+09,NaN,0,2,NaN,NaN,3
3,5,178980,214757,4.199834e+09,4.200034e+09,1,5,4.199839e+09,4.199847e+09,0.0844,0.253056,4.199818e+09,NaN,0,1,NaN,NaN,0
4,6,107064,228232,6.482100e+09,6.483514e+09,1,2,6.482151e+09,6.482468e+09,3.6729,24084.896458,4.401216e+09,NaN,0,2,NaN,NaN,4

# 6. Ekstraksi Tanda Vital (Vitals from Chartevents)

**Tujuan:**
Mengambil data tanda vital (HR, BP, SpO2, GCS, dll) dari tabel raksasa `CHARTEVENTS`.

**Metode Teknis:**
* Menggunakan **Looping Chunking** per 10.000 `ICUSTAY_ID`.
* Ini mencegah RAM crash karena ukuran tabel yang sangat besar.
* **Output:** 10 file terpisah (`ce010000.csv`, `ce1000020000.csv`, dst).

In [10]:
for i in range(0,100000,10000):
    print(f"Processing chunk: {i} to {i+10000}...") # Perbaikan print
    
    # Query asli (hanya hapus 'mimiciii.')
    query = """
    select distinct icustay_id, extract(epoch from charttime) as charttime, itemid, 
    case when value = 'None' then '0' when value = 'Ventilator' then '1' when value='Cannula' then '2' when value = 'Nasal Cannula' then '2' when value = 'Face Tent' then '3' when value = 'Aerosol-Cool' then '4' when value = 'Trach Mask' then '5' when value = 'Hi Flow Neb' then '6' when value = 'Non-Rebreather' then '7' when value = '' then '8'  when value = 'Venti Mask' then '9' when value = 'Medium Conc Mask' then '10' else valuenum end as valuenum 
    from chartevents 
    where icustay_id>="""+str(200000+i)+""" and icustay_id< """ + str(210000+i) + """ and value is not null and itemid in  (467, 470,471,223834,227287,194,224691,226707,226730    ,581,    580,    224639    ,226512,198,228096    ,211,220045,220179,225309,6701,    6    ,227243,    224167,    51,    455, 220181,    220052,    225312,    224322,    6702,    443    ,52,    456,8368    ,8441,    225310    ,8555    ,8440,220210    ,3337    ,224422    ,618,    3603,    615,220277,    646,    834,3655,    223762    ,223761,    678,220074    ,113,492,491,8448,116,    1372    ,1366    ,228368    ,228177,626,223835,3420,160,    727,190,220339    ,506    ,505,    224700,224686,224684,684,    224421,224687,    450    ,448    ,445,224697,444,224695,    535,224696    ,543,3083,    2566    ,654    ,3050,681,    2311)  
    order by icustay_id, charttime 
    """
    
    d = pd.read_sql_query(query,conn)
    # Nama file asli dipertahankan: ce010000.csv, dst
    filename = 'ce' + str(i) + str(i+10000) + '.csv'
    d.to_csv(exportdir + filename, index=False, sep='|')
    print(f"  --> Saved: {filename}")

print("SELESAI! Semua chunk Vitals tersimpan.")

Processing chunk: 0 to 10000...

/tmp/ipykernel_31434/239448906.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  d = pd.read_sql_query(query,conn)

  --> Saved: ce010000.csv
Processing chunk: 10000 to 20000...
  --> Saved: ce1000020000.csv
Processing chunk: 20000 to 30000...
  --> Saved: ce2000030000.csv
Processing chunk: 30000 to 40000...
  --> Saved: ce3000040000.csv
Processing chunk: 40000 to 50000...
  --> Saved: ce4000050000.csv
Processing chunk: 50000 to 60000...
  --> Saved: ce5000060000.csv
Processing chunk: 60000 to 70000...
  --> Saved: ce6000070000.csv
Processing chunk: 70000 to 80000...
  --> Saved: ce7000080000.csv
Processing chunk: 80000 to 90000...
  --> Saved: ce8000090000.csv
Processing chunk: 90000 to 100000...
  --> Saved: ce90000100000.csv
SELESAI! Semua chunk Vitals tersimpan.

# 7. Ekstraksi Data Lab Tambahan (Labs from Chartevents)

**Tujuan:**
Mengambil data hasil laboratorium yang tercatat di *bedside monitor* (catatan perawat), bukan dari sistem laboratorium pusat.

**Penjelasan Teknis:**
* Beberapa parameter seperti **Glukosa (Fingerstick)** sering dicatat langsung oleh perawat di chart, bukan dikirim ke lab.
* Ekstraksi ini penting untuk melengkapi data `LABEVENTS` jika ada kekosongan data pada jam-jam tertentu.
* **Output:** File `labs_ce.csv`.

In [11]:
query = """
select icustay_id, extract(epoch from charttime) as charttime, itemid, valuenum
from chartevents
where valuenum is not null and icustay_id is not null and itemid in  (829, 1535, 227442, 227464, 4195 ,3726 ,3792,837, 220645, 4194, 3725, 3803 ,226534, 1536, 4195, 3726,788, 220602, 1523, 4193, 3724 ,226536, 3747,225664, 807, 811, 1529, 220621, 226537, 3744,781, 1162, 225624, 3737,791, 1525, 220615, 3750,821, 1532, 220635,786, 225625, 1522, 3746,816, 225667, 3766,777, 787,770, 3801,769, 3802,1538, 848, 225690, 803, 1527, 225651, 3807, 1539, 849, 772, 1521, 227456, 3727, 227429, 851,227444, 814, 220228, 813, 220545, 3761, 226540, 4197, 3799 ,1127, 1542, 220546, 4200, 3834, 828, 227457, 3789,825, 1533, 227466, 3796,824, 1286,1671, 1520, 768,220507 ,815, 1530, 227467, 780, 1126, 3839, 4753,779, 490, 3785, 3838, 3837,778, 3784, 3836, 3835,776, 224828, 3736, 4196, 3740, 74,225668,1531,227443,1817, 228640,823, 227686)
order by icustay_id, charttime, itemid
"""

print("Extracting labs from chartevents...")
d = pd.read_sql_query(query,conn)
d.to_csv(exportdir+'labs_ce.csv',index=False,sep='|')
d.head()

Extracting labs from chartevents...

/tmp/ipykernel_31434/1080077946.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  d = pd.read_sql_query(query,conn)

   icustay_id     charttime  itemid  valuenum
0      200001  6.686998e+09  224828      1.00
1      200001  6.686998e+09  225667      1.13
2      200001  6.686998e+09  225668      1.40
3      200001  6.686998e+09  227464      4.60
4      200001  6.687007e+09  225664    118.00

# 8. Ekstraksi Data Lab Utama (Labs from Labevents)

**Tujuan:**
Mengambil hasil tes laboratorium utama (Kimia Darah, Hematologi, Gas Darah) yang divalidasi oleh sistem lab rumah sakit.

**Sumber Data:**
* `LABEVENTS` (Data Lab)
* `ICUSTAYS` (Untuk filter waktu masuk/keluar)

**Penjelasan Teknis:**
* **Filter Waktu:** Mengambil data dalam rentang waktu kritis: `[Waktu Masuk ICU - 1 Hari]` sampai `[Waktu Keluar ICU + 1 Hari]`. Ini untuk menangkap kondisi awal (baseline) sebelum masuk ICU dan kondisi akhir.
* **Parameter Penting:** Laktat, WBC, Kreatinin, Bilirubin, Platelet, dll.
* **Output:** File `labs_le.csv`.

In [12]:
query = """
select xx.icustay_id, extract(epoch from f.charttime) as timestp, f.itemid, f.valuenum
from(
    select subject_id, hadm_id, icustay_id, intime, outtime
    from icustays
    group by subject_id, hadm_id, icustay_id, intime, outtime
) as xx 
inner join labevents as f 
  on f.hadm_id=xx.hadm_id 
  and f.charttime>=xx.intime-interval '1 day' 
  and f.charttime<=xx.outtime+interval '1 day' 
  and f.itemid in (50971,50822,50824,50806,50931,51081,50885,51003,51222,50810,51301,50983,50902,50809,51006,50912,50960,50893,50808,50804,50878,50861,51464,50883,50976,50862,51002,50889,50811,51221,51279,51300,51265,51275,51274,51237,50820,50821,50818,50802,50813,50882,50803) 
  and valuenum is not null
order by f.hadm_id, timestp, f.itemid
"""

print("Extracting labs from labevents...")
d = pd.read_sql_query(query,conn)
d.to_csv(exportdir+'labs_le.csv',index=False,sep='|')
d.head()

Extracting labs from labevents...

/tmp/ipykernel_31434/2680662632.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  d = pd.read_sql_query(query,conn)

   icustay_id       timestp  itemid  valuenum
0      275225  4.660792e+09   50861      10.0
1      275225  4.660792e+09   50878      16.0
2      275225  4.660792e+09   50882      11.0
3      275225  4.660792e+09   50885       0.5
4      275225  4.660792e+09   50902     101.0

# 9. Ekstraksi Produksi Urin (Urine Output)

**Tujuan:**
Mengambil data volume urin yang keluar dari pasien secara *real-time*.

**Sumber Data:**
* `OUTPUTEVENTS` (Data Output Cairan)

**Penjelasan Teknis:**
* Mengambil data dari berbagai metode pengukuran (Foley Catheter, Void, dll).
* **Relevansi Sepsis:** Penurunan produksi urin (Oliguria) adalah indikator kuat disfungsi organ ginjal akibat syok sepsis.
* **Output:** File `uo.csv`.

In [13]:
query = """
select icustay_id, extract(epoch from charttime) as charttime, itemid, value
from outputevents
where icustay_id is not null and value is not null and itemid in (40055 ,43175 ,40069, 40094 ,40715 ,40473 ,40085, 40057, 40056 ,40405 ,40428, 40096, 40651,226559 ,226560 ,227510 ,226561 ,227489 ,226584, 226563 ,226564 ,226565 ,226557 ,226558)
order by icustay_id, charttime, itemid
"""

print("Extracting urine output...")
d = pd.read_sql_query(query,conn)
d.to_csv(exportdir+'uo.csv',index=False,sep='|')
d.head()

Extracting urine output...

/tmp/ipykernel_31434/3083719898.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  d = pd.read_sql_query(query,conn)

   icustay_id     charttime  itemid  value
0      200001  6.687007e+09  226560  250.0
1      200001  6.687089e+09  226560   60.0
2      200001  6.687222e+09  226560   50.0
3      200003  7.245058e+09   40069  230.0
4      200003  7.245065e+09   40069    0.0

# 10. Ekstraksi Urin Pra-Admisi (Pre-admission UO)

**Tujuan:**
Mengambil data produksi urin yang tercatat sebelum pasien resmi masuk ICU (misalnya saat masih di IGD).

**Sumber Data:**
* `OUTPUTEVENTS` (Data Urin)
* `ICUSTAYS` (Data waktu masuk ICU)

**Penjelasan Teknis:**
* Menghitung selisih waktu (`datediff_minutes`) antara waktu masuk ICU (`intime`) dan waktu pencatatan urin.
* Data ini penting untuk mengetahui status fungsi ginjal awal sebelum perawatan intensif dimulai.
* **Output:** File `preadm_uo.csv`.

In [14]:
query = """
select distinct oe.icustay_id, extract(epoch from oe.charttime) as charttime, oe.itemid, oe.value , 60*24*date_part('day',ic.intime-oe.charttime)  + 60*date_part('hour',ic.intime-oe.charttime) + date_part('min',ic.intime-oe.charttime) as datediff_minutes
from outputevents oe, icustays ic
where oe.icustay_id=ic.icustay_id and itemid in (40060, 226633)
order by icustay_id, charttime, itemid
"""

print("Extracting pre-admission UO...")
d = pd.read_sql_query(query,conn)
d.to_csv(exportdir+'preadm_uo.csv',index=False,sep='|')
d.head()

Extracting pre-admission UO...

/tmp/ipykernel_31434/1844153748.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  d = pd.read_sql_query(query,conn)

   icustay_id     charttime  itemid  value  datediff_minutes
0      200006  5.985493e+09   40060  950.0             -91.0
1      200019  6.580174e+09   40060  600.0             -56.0
2      200019  6.580184e+09   40060    0.0            -236.0
3      200030  5.707637e+09   40060  240.0             -36.0
4      200035  5.894001e+09  226633  400.0             -34.0

# 11. Ekstraksi Cairan Infus (MetaVision)

**Tujuan:**
Mengambil data input cairan (NaCl, Ringer Laktat, Dextrose, dll) dari sistem pencatatan MetaVision (data tahun 2008-2012).

**Sumber Data:**
* `INPUTEVENTS_MV`

**Penjelasan Teknis:**
* **Tonicity Correction:** Query ini melakukan normalisasi volume cairan berdasarkan kadar garam/gula (tonisitas).
* Contoh: Dextrose 5% dikalikan faktor 0.5 atau 0.25 agar setara dengan efek volume NaCl 0.9% (Cairan Isotonik).
* **Output:** File `fluid_mv.csv`.

In [15]:
query = """


with t1 as
(
select icustay_id, extract(epoch from starttime) as starttime, extract(epoch from endtime) as endtime, itemid, amount, rate,
case when itemid in (30176,30315) then amount *0.25
when itemid in (30161) then amount *0.3
when itemid in (30020,30015,225823,30321,30186,30211, 30353,42742,42244,225159) then amount *0.5 --
when itemid in (227531) then amount *2.75
when itemid in (30143,225161) then amount *3
when itemid in (30009,220862) then amount *5
when itemid in (30030,220995,227533) then amount *6.66
when itemid in (228341) then amount *8
else amount end as tev -- total equivalent volume
from inputevents_mv
-- only real time items !!
where icustay_id is not null and amount is not null and itemid in (225158,225943,226089,225168,225828,225823,220862,220970,220864,225159,220995,225170,225825,227533,225161,227531,225171,225827,225941,225823,225825,225941,225825,228341,225827,30018,30021,30015,30296,30020,30066,30001,30030,30060,30005,30321,3000630061,30009,30179,30190,30143,30160,30008,30168,30186,30211,30353,30159,30007,30185,30063,30094,30352,30014,30011,30210,46493,45399,46516,40850,30176,30161,30381,30315,42742,30180,46087,41491,30004,42698,42244)
)


select icustay_id, starttime, endtime, itemid, round(cast(amount as numeric),3) as amount,round(cast(rate as numeric),3) as rate,round(cast(tev as numeric),3) as tev -- total equiv volume
from t1
order by icustay_id, starttime, itemid

"""
d = pd.read_sql_query(query,conn)
d.to_csv(exportdir+'fluid_mv.csv',index=False,sep='|')
d.head()

/tmp/ipykernel_31434/3735766217.py:27: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  d = pd.read_sql_query(query,conn)

   icustay_id     starttime       endtime  itemid    amount  rate       tev
0      200001  6.687010e+09  6.687010e+09  225943    50.000   NaN    50.000
1      200001  6.687014e+09  6.687158e+09  225158   200.000   5.0   200.000
2      200001  6.687185e+09  6.687185e+09  225158   250.000   NaN   250.000
3      200010  5.130953e+09  5.130958e+09  225158    17.708  12.5    17.708
4      200010  5.130956e+09  5.130956e+09  225158  1000.000   NaN  1000.000

# 12. Ekstraksi Cairan Infus (CareVue)

**Tujuan:**
Mengambil data input cairan dari sistem pencatatan lama (**CareVue**), yang digunakan sebelum tahun 2008 di MIMIC-III.

**Sumber Data:**
* `INPUTEVENTS_CV`

**Penjelasan Teknis:**
* Sama seperti MetaVision, query ini melakukan **Koreksi Tonisitas** (mengubah volume cairan berdasarkan kadar garam/gula agar setara dengan NaCl 0.9%).
* **Perbedaan:** Di CareVue, catatan input seringkali dianggap sebagai dosis *STAT* (sekaligus/bolus), bukan *rate* per jam yang berkelanjutan.
* **Output:** File `fluid_cv.csv`.

In [16]:
query = """
with t1 as
(
select icustay_id, extract(epoch from charttime) as charttime, itemid, amount,
case when itemid in (30176,30315) then amount *0.25
when itemid in (30161) then amount *0.3
when itemid in (30020,30321, 30015,225823,30186,30211,30353,42742,42244,225159,225159,225159) then amount *0.5
when itemid in (227531) then amount *2.75
when itemid in (30143,225161) then amount *3
when itemid in (30009,220862) then amount *5
when itemid in (30030,220995,227533) then amount *6.66
when itemid in (228341) then amount *8
else amount end as tev -- total equivalent volume
from inputevents_cv
-- only RT itemids
where amount is not null and itemid in (225158,225943,226089,225168,225828,225823,220862,220970,220864,225159,220995,225170,225825,227533,225161,227531,225171,225827,225941,225823,225825,225941,225825,228341,225827,30018,30021,30015,30296,30020,30066,30001,30030,30060,30005,30321,3000630061,30009,30179,30190,30143,30160,30008,30168,30186,30211,30353,30159,30007,30185,30063,30094,30352,30014,30011,30210,46493,45399,46516,40850,30176,30161,30381,30315,42742,30180,46087,41491,30004,42698,42244)
order by icustay_id, charttime, itemid
)


select icustay_id, charttime, itemid, round(cast(amount as numeric),3) as amount, round(cast(tev as numeric),3) as tev -- total equivalent volume
from t1

"""
print("Extracting fluid CV...")
d = pd.read_sql_query(query,conn)
d.to_csv(exportdir+'fluid_cv.csv',index=False,sep='|')
d.head()

Extracting fluid CV...

/tmp/ipykernel_31434/1623554595.py:26: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  d = pd.read_sql_query(query,conn)

   icustay_id     charttime  itemid  amount     tev
0    200003.0  7.245058e+09   30015     0.0     0.0
1    200003.0  7.245061e+09   30015   100.0    50.0
2    200003.0  7.245061e+09   30018  1000.0  1000.0
3    200003.0  7.245065e+09   30015   100.0    50.0
4    200003.0  7.245065e+09   30018  1000.0  1000.0

# 13. Ekstraksi Cairan Pra-Admisi

**Tujuan:**
Menghitung total volume cairan (resusitasi) yang masuk ke tubuh pasien sebelum waktu resmi masuk ICU (`intime`).

**Sumber Data:**
* Gabungan dari `INPUTEVENTS_MV` dan `INPUTEVENTS_CV`.
* Tabel `D_ITEMS` (untuk filter jenis cairan).

**Relevansi:**
Pasien sepsis seringkali sudah mendapatkan penanganan awal di IGD. Data ini penting agar model AI mengetahui status hidrasi awal pasien.
**Output:** `preadm_fluid.csv`.

In [17]:
query = """


with mv as
(
select ie.icustay_id, sum(ie.amount) as sum
from inputevents_mv ie, d_items ci
where ie.itemid=ci.itemid and ie.itemid in (30054,30055,30101,30102,30103,30104,30105,30108,226361,226363,226364,226365,226367,226368,226369,226370,226371,226372,226375,226376,227070,227071,227072)
group by icustay_id
), cv as
(
select ie.icustay_id, sum(ie.amount) as sum
from inputevents_cv ie, d_items ci
where ie.itemid=ci.itemid and ie.itemid in (30054,30055,30101,30102,30103,30104,30105,30108,226361,226363,226364,226365,226367,226368,226369,226370,226371,226372,226375,226376,227070,227071,227072)
group by icustay_id
)


select pt.icustay_id,
case when mv.sum is not null then mv.sum
when cv.sum is not null then cv.sum
else null end as inputpreadm
from icustays pt
left outer join mv
on mv.icustay_id=pt.icustay_id
left outer join cv
on cv.icustay_id=pt.icustay_id
order by icustay_id

"""
d = pd.read_sql_query(query,conn)
d.to_csv(exportdir+'preadm_fluid.csv',index=False,sep='|')
d.head()

/tmp/ipykernel_31434/560620733.py:31: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  d = pd.read_sql_query(query,conn)

   icustay_id  inputpreadm
0      200001          NaN
1      200003       1400.0
2      200006       2000.0
3      200007          NaN
4      200009       8900.0

# 14. Ekstraksi Vasopressor (MetaVision)

**Tujuan:**
Mengambil data pemberian obat vasopressor (penaik tekanan darah) dari sistem MetaVision.

**Konversi Standar (Norepinephrine Equivalent):**
Agar semua obat bisa dibandingkan, dosisnya dikonversi ke skala Noradrenalin:
* **Norepinephrine:** 1:1
* **Epinephrine:** 1:1
* **Phenylephrine:** 0.45:1
* **Dopamine:** 0.01:1
* **Vasopressin:** 2.5:1 (Normalisasi unit).

**Output:** `vaso_mv.csv`.

In [18]:
query = """
select icustay_id, itemid, extract(epoch from starttime) as starttime, extract(epoch from endtime) as endtime, -- rate, -- ,rateuom,
case when itemid in (30120,221906,30047) and rateuom='mcg/kg/min' then round(cast(rate as numeric),3)  -- norad
when itemid in (30120,221906,30047) and rateuom='mcg/min' then round(cast(rate/80 as numeric),3)  -- norad
when itemid in (30119,221289) and rateuom='mcg/kg/min' then round(cast(rate as numeric),3) -- epi
when itemid in (30119,221289) and rateuom='mcg/min' then round(cast(rate/80 as numeric),3) -- epi
when itemid in (30051,222315) and rate > 0.2 then round(cast(rate*5/60  as numeric),3) -- vasopressin, in U/h
when itemid in (30051,222315) and rateuom='units/min' then round(cast(rate*5 as numeric),3) -- vasopressin
when itemid in (30051,222315) and rateuom='units/hour' then round(cast(rate*5/60 as numeric),3) -- vasopressin
when itemid in (30128,221749,30127) and rateuom='mcg/kg/min' then round(cast(rate*0.45 as numeric),3) -- phenyl
when itemid in (30128,221749,30127) and rateuom='mcg/min' then round(cast(rate*0.45 / 80 as numeric),3) -- phenyl
when itemid in (221662,30043,30307) and rateuom='mcg/kg/min' then round(cast(rate*0.01 as numeric),3)  -- dopa
when itemid in (221662,30043,30307) and rateuom='mcg/min' then round(cast(rate*0.01/80 as numeric),3) else null end as rate_std-- dopa
from inputevents_mv
where itemid in (30128,30120,30051,221749,221906,30119,30047,30127,221289,222315,221662,30043,30307) and rate is not null and statusdescription <> 'Rewritten'
order by icustay_id, itemid, starttime

"""
d = pd.read_sql_query(query,conn)
d.to_csv(exportdir+'vaso_mv.csv',index=False,sep='|')
d.head()

/tmp/ipykernel_31434/4199920592.py:19: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  d = pd.read_sql_query(query,conn)

   icustay_id  itemid     starttime       endtime  rate_std
0    200024.0  221662  4.959764e+09  4.959780e+09     0.200
1    200024.0  221906  4.959764e+09  4.959766e+09     0.301
2    200024.0  221906  4.959766e+09  4.959768e+09     0.200
3    200024.0  221906  4.959768e+09  4.959779e+09     0.502
4    200024.0  222315  4.959764e+09  4.959780e+09     0.200

# 15. Ekstraksi Vasopressor (CareVue)

**Tujuan:**
Mengambil data vasopressor dari sistem lama (CareVue).

**Penjelasan Teknis:**
* Sama seperti MetaVision, menggunakan konversi *Norepinephrine Equivalent*.
* Menangani inkonsistensi penulisan satuan di database lama (misal typo `mcgkgmin`).
**Output:** `vaso_cv.csv`.

In [19]:
query = """
select icustay_id,  itemid, extract(epoch from charttime) as charttime, -- rate, -- rateuom,
case when itemid in (30120,221906,30047) and rateuom='mcgkgmin' then round(cast(rate as numeric),3) -- norad
when itemid in (30120,221906,30047) and rateuom='mcgmin' then round(cast(rate/80 as numeric),3)  -- norad
when itemid in (30119,221289) and rateuom='mcgkgmin' then round(cast(rate as numeric),3) -- epi
when itemid in (30119,221289) and rateuom='mcgmin' then round(cast(rate/80 as numeric),3) -- epi
when itemid in (30051,222315) and rate > 0.2 then round(cast(rate*5/60  as numeric),3) -- vasopressin, in U/h
when itemid in (30051,222315) and rateuom='Umin' and rate < 0.2 then round(cast(rate*5  as numeric),3) -- vasopressin
when itemid in (30051,222315) and rateuom='Uhr' then round(cast(rate*5/60  as numeric),3) -- vasopressin
when itemid in (30128,221749,30127) and rateuom='mcgkgmin' then round(cast(rate*0.45  as numeric),3) -- phenyl
when itemid in (30128,221749,30127) and rateuom='mcgmin' then round(cast(rate*0.45 / 80  as numeric),3) -- phenyl
when itemid in (221662,30043,30307) and rateuom='mcgkgmin' then round(cast(rate*0.01   as numeric),3) -- dopa
when itemid in (221662,30043,30307) and rateuom='mcgmin' then round(cast(rate*0.01/80  as numeric),3) else null end as rate_std-- dopa
-- case when rateuom='mcgkgmin' then 1 when rateuom='mcgmin' then 2 end as uom
from inputevents_cv
where itemid in (30128,30120,30051,221749,221906,30119,30047,30127,221289,222315,221662,30043,30307) and rate is not null
order by icustay_id, itemid, charttime

"""
d = pd.read_sql_query(query,conn)
d.to_csv(exportdir+'vaso_cv.csv',index=False,sep='|')
d.head()

/tmp/ipykernel_31434/1148462987.py:20: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  d = pd.read_sql_query(query,conn)

   icustay_id  itemid     charttime  rate_std
0    200003.0   30128  7.245140e+09     0.225
1    200003.0   30128  7.245140e+09     0.225
2    200003.0   30128  7.245143e+09     0.225
3    200003.0   30128  7.245143e+09     0.225
4    200003.0   30128  7.245143e+09     0.225

# 16. Ekstraksi Ventilasi Mekanis

**Tujuan:**
Mendeteksi periode waktu di mana pasien menggunakan alat bantu napas (Ventilator).

**Logika Deteksi:**
Query ini tidak hanya melihat status "Ventilator", tetapi memeriksa keberadaan parameter fisik ventilator seperti:
* PEEP (Positive End-Expiratory Pressure)
* Tidal Volume
* Inspiratory Pressure
* ETT (Endotracheal Tube) size

Jika salah satu parameter ini ada nilainya, pasien dianggap sedang diventilasi.
**Output:** `mechvent.csv`.

In [20]:
query = """


select
    icustay_id, extract(epoch from charttime) as charttime    -- case statement determining whether it is an instance of mech vent
    , max(
      case
        when itemid is null or value is null then 0 -- can't have null values
        when itemid = 720 and value != 'Other/Remarks' THEN 1  -- VentTypeRecorded
        when itemid = 467 and value = 'Ventilator' THEN 1 -- O2 delivery device == ventilator
        when itemid in
          (
          445, 448, 449, 450, 1340, 1486, 1600, 224687 -- minute volume
          , 639, 654, 681, 682, 683, 684,224685,224684,224686 -- tidal volume
          , 218,436,535,444,459,224697,224695,224696,224746,224747 -- High/Low/Peak/Mean/Neg insp force ("RespPressure")
          , 221,1,1211,1655,2000,226873,224738,224419,224750,227187 -- Insp pressure
          , 543 -- PlateauPressure
          , 5865,5866,224707,224709,224705,224706 -- APRV pressure
          , 60,437,505,506,686,220339,224700 -- PEEP
          , 3459 -- high pressure relief
          , 501,502,503,224702 -- PCV
          , 223,667,668,669,670,671,672 -- TCPCV
          , 157,158,1852,3398,3399,3400,3401,3402,3403,3404,8382,227809,227810 -- ETT
          , 224701 -- PSVlevel
          )
          THEN 1
        else 0
      end
      ) as MechVent
      , max(
        case when itemid is null or value is null then 0
          when itemid = 640 and value = 'Extubated' then 1
          when itemid = 640 and value = 'Self Extubation' then 1
        else 0
        end
        )
        as Extubated
      , max(
        case when itemid is null or value is null then 0
          when itemid = 640 and value = 'Self Extubation' then 1
        else 0
        end
        )
        as SelfExtubated


  from chartevents ce
  where value is not null
  and itemid in
  (
      640 -- extubated
      , 720 -- vent type
      , 467 -- O2 delivery device
      , 445, 448, 449, 450, 1340, 1486, 1600, 224687 -- minute volume
      , 639, 654, 681, 682, 683, 684,224685,224684,224686 -- tidal volume
      , 218,436,535,444,459,224697,224695,224696,224746,224747 -- High/Low/Peak/Mean/Neg insp force ("RespPressure")
      , 221,1,1211,1655,2000,226873,224738,224419,224750,227187 -- Insp pressure
      , 543 -- PlateauPressure
      , 5865,5866,224707,224709,224705,224706 -- APRV pressure
      , 60,437,505,506,686,220339,224700 -- PEEP
      , 3459 -- high pressure relief
      , 501,502,503,224702 -- PCV
      , 223,667,668,669,670,671,672 -- TCPCV
      , 157,158,1852,3398,3399,3400,3401,3402,3403,3404,8382,227809,227810 -- ETT
      , 224701 -- PSVlevel
  )
  group by icustay_id, charttime


"""
d = pd.read_sql_query(query,conn)
d.to_csv(exportdir+'mechvent.csv',index=False,sep='|')
d.head()

/tmp/ipykernel_31434/3374314241.py:71: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  d = pd.read_sql_query(query,conn)

   icustay_id     charttime  mechvent  extubated  selfextubated
0    200003.0  7.245055e+09         0          0              0
1    200003.0  7.245058e+09         0          0              0
2    200003.0  7.245061e+09         0          0              0
3    200003.0  7.245065e+09         0          0              0
4    200003.0  7.245067e+09         0          0              0